
* Available epochs

|       Date |    JD | Camera | Filter     | Line    | PI          |
|------------+-------+--------+------------+---------+-------------|
|   1995.080 | 49797 | PC     | f502n      | [O III] |             |
| 1997-12-29 | 50812 | STIS   | f28x50oiii | [O III] | McCaughrean |
| 2004-01-14 | 53018 | ACS    | f658n      | Ha      | Bally       |
|       2004 | 53025 | ACS    | fr505n     | [O III] |             |
| 2005-04-07 | 53465 | ACS    | f658n      | Ha      | Robberto    |
| 2015-01-10 | 57032 | WFC3   | f658n      | Ha      | Bally       |

+ So we have 20 years all together, with 10 yr timespans and 1 yr timespans in similar filters
+ Movement of 1 pixel (0.05 arcsec) in 10 years is
  + 0.05 410 au / 10 yr km
  + = 9.7 km/s 


* Some things of note
+ HH 873 (red jet) is moving sideways it seems
+ Have to be careful with the interference fringes in the WFC3 field
+ Robberto image needed shifting slightly, which is odd since it is supposed to be the reference
  + Only 0.5 pixels in declination: changed CRPIX2 from 3750 to 3750.5
  + [[file:data-historic/robb-strip0l-fine-shift.wcs]]
+ Stars have mainly sub-pixel shifts (< 10 km/s)
+ Hard to see any movement in the big arc


* Gaia proper motions for the stars 
+ [[file:1528687267993O-result.csv]]
+ [[file:1528687195871O-result.json]]
+ These do not look reliable at all
  + The highest velocities are stars like 159-350, which look rock solid on the HST images



|            source_id |          ra | ra_error |         dec | dec_error | parallax | parallax_error |     pmra | pmra_error |       pmdec | pmdec_error | phot_g_mean_mag |  bp_rp |   teff_val |
| 3017364063331140224 | 83.81971906 |  0.0532 | -5.39034013 | 0.059865 |  2.47231 |      0.082145 |    5.454 |   0.11214 |     -1.7719 |     0.1024 |         9.92 |  0.33 | 7081.8604 |
| 3017364059023817600 |  83.8211155 |  0.0768 | -5.39278611 |  0.08572 | 1.536199 |      0.101459 |  0.71152 |   0.16212 |     1.63107 |     0.1199 |        12.33 |   1.2 | 5095.6333 |
| 3017363960237919616 | 83.81229107 |  0.1650 | -5.39423111 |  0.20282 | 2.329208 |      0.265418 |   0.8571 |   0.37443 |     0.54545 |     0.2987 |        12.68 | 0.698 | 5095.6333 |
| 3017364132049943680 |  83.8172304 | 0.04544 | -5.38521240 |  0.04921 | 2.482391 |      0.069177 |   1.4586 |    0.1112 |     1.03026 |     0.0993 |        7.810 | 0.530 | 7118.3335 |
| 3017364063331576192 | 83.81980561 |    20.2 | -5.38790036 |   18.881 |          |               |          |           |             |            |        12.79 |       |           |
| 3017364063330467072 | 83.82586702 | 0.05424 | -5.39330716 |  0.05241 |  2.57729 |      0.079316 |  1.31685 |   0.13396 | -0.00230642 |      0.099 |       12.727 |  1.49 |    5076.0 |
| 3017364063331576832 | 83.82446788 |   3.296 |  -5.3842026 |   2.7387 |          |               |          |           |             |            |        14.66 |       |           |
| 3017363955944598016 | 83.81646356 |   0.361 | -5.39722883 |   0.3490 | 0.789721 |      0.499022 |  2.79565 |    0.8147 |     -4.7833 |      0.740 |        11.90 |  1.45 |   5143.45 |
| 3017364127743288704 | 83.81572326 |  0.0590 |  -5.3860752 |  0.07243 |   2.3882 |      0.094658 |  1.61387 |   0.12220 |      1.2281 |      0.113 |         9.64 |  1.45 |    4475.0 |
| 3017364127743288320 | 83.81515177 | 0.04038 | -5.38234306 |  0.04271 | 2.518322 |      0.055075 |  1.08447 |   0.12061 |     1.44977 |     0.0958 |        12.11 |  1.37 |   5143.45 |
| 3017364063330718080 | 83.81861916 |   0.266 |  -5.3896961 |   0.2532 | 2.706628 |       0.33227 |  2.11115 |    0.6455 |    -0.58792 |      0.519 |         4.93 | 0.154 |    8373.5 |
| 3017363955944591872 | 83.81220930 |     33. | -5.39139432 |   17.324 |          |               |          |           |             |            |        14.14 |       |           |
| 3017363960251507712 | 83.81555490 |  0.2311 |  -5.3895812 |  0.23124 |  2.47820 |      0.331159 |   4.4891 |    0.6071 |     -3.5854 |      0.649 |        13.14 | 0.830 | 5095.6333 |
| 3017364132050194688 | 83.81594504 |  0.0657 | -5.38731406 |  0.07235 |  2.37309 |      0.104602 |  1.53615 |    0.1582 |     0.12312 |     0.1389 |        6.609 | 0.150 |   8911.75 |
| 3017364063325263360 | 83.82076962 |   0.254 | -5.39362497 |   0.2630 | 2.056556 |      0.338141 |  3.15887 |    0.5898 |    -1.44901 |      0.503 |        13.31 |  0.77 | 5095.6333 |
| 3017364063331138432 | 83.82602396 |   2.561 | -5.38766986 |   2.2066 |          |               |          |           |             |            |        14.24 |       |           |
| 3017364063330465152 | 83.82191390 | 0.04564 | -5.38793462 | 0.052050 | 2.116643 |      0.072350 |  1.83601 |   0.11452 |     0.16491 |     0.1011 |         6.56 | 0.264 |    8613.0 |
| 3017364063330453504 |  83.8207520 |   0.129 | -5.38359680 |  0.13348 | 2.512819 |       0.16482 |  3.10304 |    0.3235 |     1.27748 |     0.2583 |        13.28 |  0.79 | 5095.6333 |
| 3017363960241964032 |  83.8143488 |   0.345 |  -5.3959645 |   0.3249 | 2.862221 |       0.52959 |   3.2897 |    0.8388 |     0.41961 |      0.651 |        13.53 |       |           |
| 3017364063323198080 | 83.81600668 |  0.3218 | -5.38957652 |   0.3063 | 3.303691 |       0.44435 |   4.4858 |    0.7409 |     0.90863 |      0.730 |        12.78 |  0.74 | 5095.6333 |
| 3017363960246048384 |  83.8210835 |  0.2825 |   -5.394376 |   0.3546 | 1.538196 |      0.416068 | -0.34540 |    0.5671 |   -0.456736 |      0.578 |        14.01 |  0.58 | 5095.6333 |
| 3017364059023821696 | 83.82425656 |   0.183 | -5.38766020 |  0.21563 | 2.356635 |       0.29001 |  -0.4600 |   0.41092 |     1.29927 |      0.380 |        13.49 |  0.68 | 5095.6333 |


** Convert to HMS
|            source_id |          ra |         dec | hms(ra / 15)  | hms(dec)      |       |    para | e(para) |     pmra | e(pmra) |     pmdec | e(pmdec) |      G | G - R |    V |    |     PA |
|---------------------+-------------+-------------+---------------+---------------+-------+---------+---------+----------+---------+-----------+----------+--------+-------+------+----+--------|
| 3017364063331140224 | 83.81971906 | -5.39034013 | 5@ 35' 16.73" | -5@ 23' 25.2" |       |  2.4723 |  0.0821 |    5.454 | 0.11214 |   -1.7719 |   0.1024 |   9.92 |  0.33 |  8.2 | ** |  119.0 |
| 3017364059023817600 |  83.8211155 | -5.39278611 | 5@ 35' 17.07" | -5@ 23' 34.0" |       | 1.53619 |  0.1014 |  0.71152 | 0.16212 |   1.63107 |   0.1199 |  12.33 |   1.2 |  5.2 | *  |  -37.1 |
| 3017363960237919616 | 83.81229107 | -5.39423111 | 5@ 35' 14.95" | -5@ 23' 39.2" |       | 2.32920 |  0.2654 |   0.8571 | 0.37443 |   0.54545 |   0.2987 |  12.68 | 0.698 |  1.8 |    |  -73.7 |
| 3017364132049943680 |  83.8172304 | -5.38521240 | 5@ 35' 16.14" | -5@ 23' 6.8"  |       | 2.48239 |  0.0691 |   1.4586 |  0.1112 |   1.03026 |   0.0993 |  7.810 | 0.530 |  1.5 |    |  -19.8 |
| 3017364063330467072 | 83.82586702 | -5.39330716 | 5@ 35' 18.21" | -5@ 23' 35.9" |       |  2.5772 |  0.0793 |  1.31685 | 0.13396 |   -0.0023 |    0.099 | 12.727 |  1.49 |  0.9 |    | -125.8 |
| 3017363955944598016 | 83.81646356 | -5.39722883 | 5@ 35' 15.95" | -5@ 23' 50.0" | HST 3 | 0.78972 |  0.4990 |  2.79565 |  0.8147 |   -4.7833 |    0.740 |  11.90 |  1.45 | 31.1 | ** |  168.1 |
| 3017364127743288704 | 83.81572326 |  -5.3860752 | 5@ 35' 15.77" | -5@ 23' 9.9"  |       |   2.388 |  0.0946 |  1.61387 | 0.12220 |    1.2281 |    0.113 |   9.64 |  1.45 |  1.9 |    |   -6.8 |
| 3017364127743288320 | 83.81515177 | -5.38234306 | 5@ 35' 15.64" | -5@ 22' 56.4" |       | 2.51832 |  0.0550 |  1.08447 | 0.12061 |   1.44977 |   0.0958 |  12.11 |  1.37 |  2.5 |    |  -29.0 |
| 3017364063330718080 | 83.81861916 |  -5.3896961 | 5@ 35' 16.47" | -5@ 23' 22.9" | th1c  | 2.70662 |   0.332 |  2.11115 |  0.6455 |  -0.58792 |    0.519 |   4.93 | 0.154 |  1.7 |    |  156.3 |
| 3017363960251507712 | 83.81555490 |  -5.3895812 | 5@ 35' 15.73" | -5@ 23' 22.5" |       |  2.4782 |  0.3311 |   4.4891 |  0.6071 |   -3.5854 |    0.649 |  13.14 | 0.830 |  9.1 | ** |  144.5 |
| 3017364132050194688 | 83.81594504 | -5.38731406 | 5@ 35' 15.83" | -5@ 23' 14.3" |       |  2.3730 |  0.1046 |  1.53615 |  0.1582 |   0.12312 |   0.1389 |  6.609 | 0.150 |  0.5 |    | -131.8 |
| 3017364063325263360 | 83.82076962 | -5.39362497 | 5@ 35' 16.98" | -5@ 23' 37.0" |       | 2.05655 |  0.3381 |  3.15887 |  0.5898 |  -1.44901 |    0.503 |  13.31 |  0.77 |  5.2 | *  |  140.5 |
| 3017364063330465152 | 83.82191390 | -5.38793462 | 5@ 35' 17.26" | -5@ 23' 16.6" |       | 2.11664 |  0.0723 |  1.83601 | 0.11452 |   0.16491 |   0.1011 |   6.56 | 0.264 |  0.4 |    |  138.9 |
| 3017364063330453504 |  83.8207520 | -5.38359680 | 5@ 35' 16.98" | -5@ 23' 0.9"  |       | 2.51281 |   0.164 |  3.10304 |  0.3235 |   1.27748 |   0.2583 |  13.28 |  0.79 |  3.2 |    |   54.4 |
| 3017363960241964032 |  83.8143488 |  -5.3959645 | 5@ 35' 15.44" | -5@ 23' 45.5" |       | 2.86222 |   0.529 |   3.2897 |  0.8388 |   0.41961 |    0.651 |  13.53 |       |  2.6 |    |   85.3 |
| 3017364063323198080 | 83.81600668 | -5.38957652 | 5@ 35' 15.84" | -5@ 23' 22.5" |       | 3.30369 |   0.444 |   4.4858 |  0.7409 |   0.90863 |    0.730 |  12.78 |  0.74 |  4.1 |    |   77.4 |
| 3017363960246048384 |  83.8210835 |   -5.394376 | 5@ 35' 17.06" | -5@ 23' 39.8" |       | 1.53819 |  0.4160 | -0.34540 |  0.5671 | -0.456736 |    0.578 |  14.01 |  0.58 |  6.8 | *  | -109.9 |
| 3017364059023821696 | 83.82425656 | -5.38766020 | 5@ 35' 17.82" | -5@ 23' 15.6" |       | 2.35663 |   0.290 |  -0.4600 | 0.41092 |   1.29927 |    0.380 |  13.49 |  0.68 |  4.8 |    |  -65.3 |
|---------------------+-------------+-------------+---------------+---------------+-------+---------+---------+----------+---------+-----------+----------+--------+-------+------+----+--------|
|                     |             |             | 0@ 0' 0"      | 0@ 0' 0"      |       |   2.430 |         |    1.725 |         |     0.292 |          |        |       |  2.9 |    |    0.0 |
#+TBLFM: $4=hms($-2/15);f2::$5=hms($-2);f1::$15=4.74 hypot($9 - @III$9, $11 - @III$11) / $7;f1::$17=arctan2($9 - @III$9, $11 - @III$11);f1::@1$15=V::@1$17=PA::@20$7=vmedian(@I..@II);f3::@20$9=vmedian(@I..@II);f3::@20$11=vmedian(@I..@II);f3::@20$15=vmedian(@I..@II);f1

* John Bally's 2015 Orion HST Program 13419

** Table of the observations

#+BEGIN_SRC python :return tab
  import glob
  from astropy.io import fits

  files = glob.glob('data-2016-01-11/icaz*_drz.fits')
  columns = ['TARGNAME', 'FILTER']
  tab = [['Name'] + columns, None]
  for fn in files:
      name = fn.split('/')[-1].split('_')[0]
      hdu = fits.open(fn)[0]
      tab.append([name] + [hdu.header[k] for k in columns])

#+END_SRC

#+RESULTS:
| Name      | TARGNAME                 | FILTER |
|-----------+--------------------------+--------|
| icaz01040 | M42-BOX1-TRAPEZIUM-SOUTH | F656N  |
| icaz01050 | M42-BOX1-TRAPEZIUM-SOUTH | F225W  |
| icaz01060 | M42-BOX1-TRAPEZIUM-SOUTH | F336W  |
| icaz02030 | M42-BOX1-TRAPEZIUM-SOUTH | F280N  |
| icaz02040 | M42-BOX1-TRAPEZIUM-SOUTH | F373N  |
| icaz03040 | M42-BOX2-TRAPEZIUM-WEST  | F656N  |
| icaz03050 | M42-BOX2-TRAPEZIUM-WEST  | F225W  |
| icaz03060 | M42-BOX2-TRAPEZIUM-WEST  | F336W  |
| icaz04030 | M42-BOX2-TRAPEZIUM-WEST  | F280N  |
| icaz04040 | M42-BOX2-TRAPEZIUM-WEST  | F373N  |
| icaz05040 | M42-BOX3-TRAPEZIUM-NORTH | F656N  |
| icaz05050 | M42-BOX3-TRAPEZIUM-NORTH | F225W  |
| icaz05060 | M42-BOX3-TRAPEZIUM-NORTH | F336W  |
| icaz06030 | M42-BOX3-TRAPEZIUM-NORTH | F280N  |
| icaz06040 | M42-BOX3-TRAPEZIUM-NORTH | F373N  |
| icaz07040 | M43-BOX5-BAR-SOUTHEAST   | F656N  |
| icaz07050 | M43-BOX5-BAR-SOUTHEAST   | F225W  |
| icaz07060 | M43-BOX5-BAR-SOUTHEAST   | F373N  |
| icaz08040 | M42-BOX4-BEEHIVE         | F656N  |
| icaz08050 | M42-BOX4-BEEHIVE         | F225W  |
| icaz08060 | M42-BOX4-BEEHIVE         | F373N  |
| icaz09040 | M42-BOX7-HH502           | F656N  |
| icaz09050 | M42-BOX7-HH502           | F225W  |
| icaz09060 | M42-BOX7-HH502           | F373N  |

** Things to do with this data

*** Proper motion of helical jet
:PROPERTIES:
:ID:       5829A70B-76BB-43E5-A057-2F691B291F7A
:END:
+ What Bob calls HH1132 in sec 7.3 of O'Dell et al (2015)
+ Show once and for all whether it is associated with HH529 or not
+ There is also HH1141, which Bob calls the East-second jet
  + This is /only/ identified in [N II] radial velocities
  + *This makes no sense!*
  + The axis of it is not quite exactly E-W
    + Which rules out it being an artefact of the slit orientation
  + But looking at the García-Díaz (2008) linewidth maps, it is clear that the only high radial velocity features come from HH 529 or HH 1141
*** Crazy behaviour of 160-353
+ seems to be a multipolar outflow
